jantielens/esp32-template-wifi/src/app/image_api.cpp
    // Split host and optional port
    const char* colon = strchr(hostport, ':');
    uint16_t port = default_port;
    if (colon) {
        const size_t host_len = (size_t)(colon - hostport);
        if (host_len == 0 || host_len >= host_out_len) return false;
        memcpy(host_out, hostport, host_len);
        host_out[host_len] = '\0';
        long parsed_port = strtol(colon + 1, nullptr, 10);
        if (parsed_port <= 0 || parsed_port > 65535) return false;
        port = (uint16_t)parsed_port;
    } else {
        if (strlen(hostport) >= host_out_len) return false;
        strncpy(host_out, hostport, host_out_len);
        host_out[host_out_len - 1] = '\0';
    }

    const char* path = slash ? slash : "/";
    if (strlen(path) >= path_out_len) return false;
    strncpy(path_out, path, path_out_len);
    path_out[path_out_len - 1] = '\0';

    *port_out = port;
    *scheme_out = scheme;
    return true;
}

static bool download_jpeg_to_buffer(
    const char* url,
    uint8_t** out_buf,
    size_t* out_sz,
    char* err,
    size_t err_len
) {
    if (!out_buf || !out_sz) return false;
    *out_buf = nullptr;
    *out_sz = 0;

    if (!url || strlen(url) == 0) {
        snprintf(err, err_len, "Missing URL");
        return false;
    }

    if (WiFi.status() != WL_CONNECTED) {
        snprintf(err, err_len, "WiFi not connected");
        return false;
    }

    UrlScheme scheme = URL_SCHEME_HTTPS;
    char host[128];
    char path[256];
    uint16_t port = 0;
    if (!parse_http_or_https_url(url, &scheme, host, sizeof(host), &port, path, sizeof(path))) {
        snprintf(err, err_len, "Invalid URL (must be http:// or https://)");
        return false;
    }

    // Keep a decode headroom guard on PSRAM boards (TLS + decode need internal heap).
#if SOC_SPIRAM_SUPPORTED
    if (psramFound()) {
        if (scheme == URL_SCHEME_HTTPS) {
            const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (internal_free < g_cfg.decode_headroom_bytes) {
                snprintf(err, err_len, "Insufficient internal heap for TLS/decode headroom");
                return false;
            }
        }
    }
#endif

    // Conservative per-operation deadline.
    const unsigned long start_ms = millis();
    const unsigned long deadline_ms = start_ms + 15000UL;

    WiFiClientSecure client_tls;
    WiFiClient client_plain;
    Client* client = nullptr;
    if (scheme == URL_SCHEME_HTTPS) {
        client_tls.setInsecure();
        client = &client_tls;
    } else {
        client = &client_plain;
    }

    if (!client->connect(host, port)) {
        snprintf(err, err_len, "%s connect failed", scheme == URL_SCHEME_HTTPS ? "TLS" : "TCP");
        return false;
    }

    client->printf("GET %s HTTP/1.1\r\n", path);
    client->printf("Host: %s\r\n", host);
    client->print("User-Agent: esp32-template-image-api/1.0\r\n");
    client->print("Accept: image/jpeg, */*\r\n");
    client->print("Connection: close\r\n\r\n");

    // Read headers into a fixed buffer
    char header[2048];
    size_t header_len = 0;
    bool header_done = false;
    while (!header_done && millis() < deadline_ms) {
        int b = client->read();
        if (b < 0) {
            delay(1);
            continue;
        }
        if (header_len + 1 >= sizeof(header)) {
            snprintf(err, err_len, "HTTP headers too large");
            return false;
        }
        header[header_len++] = (char)b;
        if (header_len >= 4 && memcmp(header + header_len - 4, "\r\n\r\n", 4) == 0) {
            header_done = true;
            break;
        }
    }
    if (!header_done) {
        snprintf(err, err_len, "Timeout waiting for headers");
        return false;
    }
    header[header_len] = '\0';

    // Parse status code
    int status = 0;
    {
        const char* eol = strstr(header, "\r\n");
        if (!eol) {
            snprintf(err, err_len, "Invalid HTTP response");
            return false;
        }
        char status_line[128];
        const size_t slen = min((size_t)(eol - header), sizeof(status_line) - 1);
        memcpy(status_line, header, slen);
        status_line[slen] = '\0';
        // HTTP/1.1 200 OK
        if (sscanf(status_line, "HTTP/%*s %d", &status) != 1) {
            snprintf(err, err_len, "Failed to parse HTTP status");
            return false;
        }
    }
    if (status != 200) {
        snprintf(err, err_len, "HTTP status %d", status);
        return false;
    }

    // Parse headers
    bool chunked = false;
    size_t content_length = 0;
    {
        const char* p = strstr(header, "\r\n");
        if (!p) {
            snprintf(err, err_len, "Invalid HTTP headers");
            return false;
        }
        p += 2;
        while (*p) {
            const char* next = strstr(p, "\r\n");
            if (!next) break;
            if (next == p) break; // end of headers

            const size_t line_len = (size_t)(next - p);
            if (line_len > 0) {
                if (starts_with_ignore_case(p, "Content-Length:")) {
                    const char* v = p + strlen("Content-Length:");
                    while (*v == ' ' || *v == '\t') v++;
                    content_length = (size_t)strtoul(v, nullptr, 10);
                } else if (starts_with_ignore_case(p, "Transfer-Encoding:")) {
                    // If chunked, we bail for now (keeps implementation small + memory-predictable).
                    if (strstr(p, "chunked") || strstr(p, "Chunked") || strstr(p, "CHUNKED")) {
                        chunked = true;
                    }
                }
            }
            p = next + 2;
        }
    }
    if (chunked) {
        snprintf(err, err_len, "Chunked transfer unsupported");
        return false;
    }
    if (content_length == 0) {
        snprintf(err, err_len, "Missing Content-Length");
        return false;
    }
    if (content_length > g_cfg.max_image_size_bytes) {
        snprintf(err, err_len, "Image too large (%u bytes)", (unsigned)content_length);
        return false;
    }

