jantielens/esp32-template-wifi/src/app/image_api.cpp
    uint8_t* buf = (uint8_t*)image_api_alloc(content_length);
    if (!buf) {
        snprintf(err, err_len, "Out of memory allocating %u bytes", (unsigned)content_length);
        return false;
    }

    size_t pos = 0;
    while (pos < content_length && millis() < deadline_ms) {
        const int r = client->read(buf + pos, (int)min((size_t)1024, content_length - pos));
        if (r > 0) {
            pos += (size_t)r;
            continue;
        }
        delay(1);
    }

    if (pos != content_length) {
        image_api_free(buf);
        snprintf(err, err_len, "Incomplete body (%u/%u)", (unsigned)pos, (unsigned)content_length);
        return false;
    }

    if (!is_jpeg_magic(buf, content_length)) {
        image_api_free(buf);
        snprintf(err, err_len, "Downloaded data is not a JPEG");
        return false;
    }

    *out_buf = buf;
    *out_sz = content_length;
    return true;
}

// ===== Handlers =====

// POST /api/display/image - Upload and display JPEG image (deferred decode)
static void handleImageUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    (void)filename;

    // First chunk - initialize upload
    if (index == 0) {
        // If upload already in progress OR pending display, reject (client can retry)
        if (upload_state == UPLOAD_IN_PROGRESS || upload_state == UPLOAD_READY_TO_DISPLAY) {
            request->send(409, "application/json", "{\"success\":false,\"message\":\"Upload busy\"}");
            return;
        }

        Logger.logBegin("Image Upload");
        Logger.logLinef("Total size: %u bytes", request->contentLength());

        image_upload_timeout_ms = parse_timeout_ms(request);
        Logger.logLinef("Timeout: %lu ms", image_upload_timeout_ms);

        device_telemetry_log_memory_snapshot("img pre-clear");

        // Free any pending image buffer to make room for new upload
        if (pending_image_op.buffer) {
            Logger.logMessage("Upload", "Freeing pending image buffer");
            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
        }

        device_telemetry_log_memory_snapshot("img post-clear");

        // Check file size
        size_t total_size = request->contentLength();
        if (total_size > g_cfg.max_image_size_bytes) {
            Logger.logEnd("ERROR: Image too large");
            request->send(400, "application/json", "{\"success\":false,\"message\":\"Image too large\"}");
            return;
        }

        // Check memory availability.
        // - Upload uses a single contiguous buffer.
        // - The decode pipeline needs headroom (historically expressed via g_cfg.decode_headroom_bytes).

#if SOC_SPIRAM_SUPPORTED
        // `SOC_SPIRAM_SUPPORTED` means the SoC can use PSRAM, but some boards have no PSRAM fitted.
        // Use a runtime check so no-PSRAM boards don't take PSRAM-specific headroom gating.
        const bool has_psram = psramFound();
        const size_t psram_free = has_psram ? heap_caps_get_free_size(MALLOC_CAP_SPIRAM) : 0;
        const size_t psram_largest = has_psram ? heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM) : 0;
        const bool psram_can_hold_upload = has_psram && (psram_free >= total_size) && (psram_largest >= total_size);
#else
        const size_t psram_free = 0;
        const size_t psram_largest = 0;
        const bool psram_can_hold_upload = false;
#endif

        // PSRAM boards vs no-PSRAM boards behave very differently.
        // - On PSRAM boards: upload buffer is expected to land in PSRAM; keep an internal headroom guard.
        // - On no-PSRAM boards: keep the historical "total heap" guard (ESP.getFreeHeap) so we don't
        //   falsely reject when internal-only metrics look tight but the system can still operate.
#if SOC_SPIRAM_SUPPORTED
        if (has_psram) {
            const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (internal_free < g_cfg.decode_headroom_bytes) {
            Logger.logLinef(
                "ERROR: Insufficient internal memory for decode headroom (need %u, have %u)",
                (unsigned)g_cfg.decode_headroom_bytes,
                (unsigned)internal_free
            );
            device_telemetry_log_memory_snapshot("img insufficient");
            char error_msg[240];
            snprintf(
                error_msg,
                sizeof(error_msg),
                "{\"success\":false,\"message\":\"Insufficient internal memory: need %uKB decode headroom, have %uKB.\"}",
                (unsigned)(g_cfg.decode_headroom_bytes / 1024),
                (unsigned)(internal_free / 1024)
            );
            Logger.logEnd();
            request->send(507, "application/json", error_msg);
            return;
            }

            if (!psram_can_hold_upload) {
            // We'll fall back to non-PSRAM allocation; be conservative.
            const size_t heap8_free = heap_caps_get_free_size(MALLOC_CAP_8BIT);
            const size_t heap8_largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
            const size_t required_heap8 = total_size + g_cfg.decode_headroom_bytes;
            if (heap8_free < required_heap8 || heap8_largest < total_size) {
                Logger.logLinef(
                    "ERROR: Insufficient memory (need %u heap8, have %u; largest %u; internal_free %u; psram_free %u largest %u)",
                    (unsigned)required_heap8,
                    (unsigned)heap8_free,
                    (unsigned)heap8_largest,
                    (unsigned)internal_free,
                    (unsigned)psram_free,
                    (unsigned)psram_largest
                );
                device_telemetry_log_memory_snapshot("img insufficient");
                char error_msg[320];
                snprintf(
                    error_msg,
                    sizeof(error_msg),
                    "{\"success\":false,\"message\":\"Insufficient memory: need %uKB total heap, have %uKB (largest block %uKB).\"}",
                    (unsigned)(required_heap8 / 1024),
                    (unsigned)(heap8_free / 1024),
                    (unsigned)(heap8_largest / 1024)
                );
                Logger.logEnd();
                request->send(507, "application/json", error_msg);
                return;
            }
            }
        } else {
            // No PSRAM fitted: total heap + largest block check (prevents immediate alloc failure).
            const size_t free_heap = ESP.getFreeHeap();
            const size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
            const size_t headroom = image_api_no_psram_effective_headroom_bytes(g_cfg.decode_headroom_bytes, free_heap, largest);
            const size_t required = total_size + headroom;
            if (free_heap < required || largest < total_size) {
                Logger.logLinef(
                    "ERROR: Insufficient memory (need %u heap, have %u; largest %u)",
                    (unsigned)required,
                    (unsigned)free_heap,
                    (unsigned)largest
                );
                device_telemetry_log_memory_snapshot("img insufficient");
                char error_msg[256];
                snprintf(
                    error_msg,
                    sizeof(error_msg),
                    "{\"success\":false,\"message\":\"Insufficient memory: need %uKB, have %uKB (largest block %uKB).\"}",
                    (unsigned)(required / 1024),
                    (unsigned)(free_heap / 1024),
                    (unsigned)(largest / 1024)
                );
                Logger.logEnd();
                request->send(507, "application/json", error_msg);
                return;
            }
        }
#else
        // No PSRAM: total heap + largest block check (prevents immediate alloc failure).
        const size_t free_heap = ESP.getFreeHeap();
        const size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
        const size_t headroom = image_api_no_psram_effective_headroom_bytes(g_cfg.decode_headroom_bytes, free_heap, largest);
        const size_t required = total_size + headroom;
        if (free_heap < required || largest < total_size) {
            Logger.logLinef(
                "ERROR: Insufficient memory (need %u heap, have %u; largest %u)",
                (unsigned)required,
                (unsigned)free_heap,
                (unsigned)largest
            );
            device_telemetry_log_memory_snapshot("img insufficient");
            char error_msg[256];
            snprintf(
                error_msg,
                sizeof(error_msg),
                "{\"success\":false,\"message\":\"Insufficient memory: need %uKB, have %uKB (largest block %uKB).\"}",
                (unsigned)(required / 1024),
                (unsigned)(free_heap / 1024),
                (unsigned)(largest / 1024)
            );
            Logger.logEnd();
            request->send(507, "application/json", error_msg);
            return;
        }
#endif

        // Allocate buffer
        device_telemetry_log_memory_snapshot("img pre-alloc");
        image_upload_buffer = (uint8_t*)image_api_alloc(total_size);
        if (!image_upload_buffer) {
            Logger.logEnd("ERROR: Memory allocation failed");
            device_telemetry_log_memory_snapshot("img alloc-fail");
            request->send(507, "application/json", "{\"success\":false,\"message\":\"Memory allocation failed\"}");
            return;
        }
        device_telemetry_log_memory_snapshot("img post-alloc");

        image_upload_size = 0;
        upload_state = UPLOAD_IN_PROGRESS;
    }

    // Receive data chunks
    if (len && image_upload_buffer && upload_state == UPLOAD_IN_PROGRESS) {
        memcpy(image_upload_buffer + image_upload_size, data, len);
        image_upload_size += len;

        // Log progress every 10KB
        static size_t last_logged_size = 0;
        if (image_upload_size - last_logged_size >= 10240) {
            Logger.logLinef("Received: %u bytes", image_upload_size);
            last_logged_size = image_upload_size;
        }
    }

    // Final chunk - validate and queue for display
    if (final) {
        if (image_upload_buffer && image_upload_size > 0 && upload_state == UPLOAD_IN_PROGRESS) {
            Logger.logLinef("Upload complete: %u bytes", image_upload_size);

            if (!is_jpeg_magic(image_upload_buffer, image_upload_size)) {
                Logger.logLinef("Invalid header: %02X %02X %02X %02X",
                                image_upload_buffer[0], image_upload_buffer[1],
                                image_upload_buffer[2], image_upload_buffer[3]);
                Logger.logEnd("ERROR: Not a valid JPEG file");
                image_api_free(image_upload_buffer);
                image_upload_buffer = nullptr;
                image_upload_size = 0;
                upload_state = UPLOAD_IDLE;
                request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JPEG file\"}");
                return;
            }

            // Best-effort header preflight so we can return a descriptive 400 before queuing
            char preflight_err[160];
            if (!jpeg_preflight_tjpgd_supported(
                    image_upload_buffer,
                    image_upload_size,
                    g_cfg.lcd_width,
                    g_cfg.lcd_height,
                    preflight_err,
                    sizeof(preflight_err))) {
                Logger.logLinef("ERROR: JPEG preflight failed: %s", preflight_err);
                Logger.logEnd();
                image_api_free(image_upload_buffer);
                image_upload_buffer = nullptr;
                image_upload_size = 0;
                upload_state = UPLOAD_IDLE;

                char resp[256];
                snprintf(resp, sizeof(resp), "{\"success\":false,\"message\":\"%s\"}", preflight_err);
                request->send(400, "application/json", resp);
                return;
            }

            // Queue image for display by main loop (deferred operation)
            if (pending_image_op.buffer) {
                Logger.logMessage("Upload", "Replacing pending image");
                image_api_free((void*)pending_image_op.buffer);
            }

